[A_Bilashi_3 H7EditorHero]
mName=""
mLore=""

[A_Moander_1 H7EditorHero]
mName=""
mLore=""

[A_Serraphiel_1 H7EditorHero]
mName=""
mLore=""

[A_StoryHero_Maahir_1 H7EditorHero]
mName=""
mLore=""

[Artefacts.A_Armageddon H7HeroAbility]
mTooltipMagicGuild="对所有单位造成 %d.icon 火焰伤害，立即生效。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded=""
mName="剑刃末日"
mTooltip="对所有单位造成 %d.min 到 %d.max %d.icon 火焰伤害，立即生效。"

[Artefacts.A_Armageddons_Blade H7HeroItem]
mName="末日之刃"
mTooltip="%stat1 %stat1.icon 攻击 \n%stat2 %stat2.icon 防御 \n%stat3 %stat3.icon 魔力 \n%stat4 %stat4.icon 精神 \n将法术 %spell1 加入英雄法术书。"

[Artefacts.A_Piece_Arkath_Lava H7HeroItem]
mName="阿尔卡斯炽热熔岩碎片"
mTooltip="友方生物对末日审判法术免疫。"

[Artefacts.A_Piece_Arkath_Lava_Buff H7BaseBuff]
mName="末日审判防护"
mTooltip="此生物对末日审判法术免疫。"

[Prison_Reward_Armies.A_Hero_Elida_1 H7EditorHero]
mName=""
mLore=""

[Prison_Reward_Armies.A_Hero_Gotard_5 H7EditorHero]
mName=""
mLore=""

[Prison_Reward_Armies.A_Hero_Lothair_3 H7EditorHero]
mName=""
mLore=""

[TheWorld:PersistentLevel.H7Creature_0 H7Creature]
mName="远古火龙"
mLore=""

[TheWorld:PersistentLevel.H7Fort_0 H7Fort]
mName="山谷要塞"

[TheWorld:PersistentLevel.H7Fort_1 H7Fort]
mName="熔岩河要塞"

[TheWorld:PersistentLevel.H7Garrison_1 H7Garrison]
mName="火焰堡垒"

[TheWorld:PersistentLevel.H7SignPostBuoy_0 H7SignPostBuoy]
mHeadline="船只"
mMessage="需要能够召唤一艘船才能渡过这个湖泊并进入克里斯蒂安爵士的墓穴。"
mName=""

[TheWorld:PersistentLevel.H7Town_0 H7Town]
mName="活水"

[TheWorld:PersistentLevel.H7Town_1 H7Town]
mName="蔓延之火"

[TheWorld:PersistentLevel.H7Town_2 H7Town]
mName="气流"

[TheWorld:PersistentLevel.H7Town_3 H7Town]
mName="巨人堤道"

[TheWorld:PersistentLevel.H7Town_4 H7Town]
mName="亡者之城"

[TheWorld:PersistentLevel.H7Town_5 H7Town]
mName="地下六尺"

[TheWorld:PersistentLevel.H7VisitingShell_0 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="克里斯蒂安爵士之墓"

[TheWorld:PersistentLevel.H7VisitingShell_1 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="第二火焰之门"

[TheWorld:PersistentLevel.H7VisitingShell_2 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="第一火焰之门"

[TheWorld:PersistentLevel.H7VisitingShell_3 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="第三火焰之门"

[TheWorld:PersistentLevel.H7VisitingShell_4 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="战斗天使"

[TheWorld:PersistentLevel.H7VisitingShell_5 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="黄金天使"

[TheWorld:PersistentLevel.H7VisitingShell_6 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="僧侣"

[TheWorld:PersistentLevel.H7VisitingShell_7 H7VisitingShell]
mDescription=""
mDescriptionInactive=""
mName="难民小屋"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_107 H7SeqAct_Quest_NewNode]
mTitle="难民"
mDescription="访问难民小屋"
mRewardText="被赶出家园并在这间小屋找到避难所的难民们很高兴加入你，一起对抗亡灵巫师。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_2 H7SeqAct_Quest_NewNode]
mTitle="末日之刃"
mDescription="找到克里斯蒂安爵士的墓穴"
mRewardText="你找到了传说中的末日之刃！"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_24 H7SeqAct_Quest_NewNode]
mTitle="天使学徒"
mDescription="天使等级达到16级"
mRewardText="你只是个学徒"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_25 H7SeqAct_Quest_NewNode]
mTitle="天使绝地"
mDescription="天使等级达到25级"
mRewardText="你已成为绝地"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_27 H7SeqAct_Quest_NewNode]
mTitle="天使绝地大师"
mDescription="天使等级达到34级"
mRewardText="你现在是一位伟大的绝地"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_3 H7SeqAct_Quest_NewNode]
mTitle="进入火山 1"
mDescription="解除第一道火焰之门的封印"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_30 H7SeqAct_Quest_NewNode]
mTitle="进入火山 2"
mDescription="解除第二道火焰之门的封印"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_33 H7SeqAct_Quest_NewNode]
mTitle="占领蔓延之火"
mDescription="占领蔓延之火"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_40 H7SeqAct_Quest_NewNode]
mTitle="火龙王"
mDescription="击败火龙王"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_45 H7SeqAct_Quest_NewNode]
mTitle="占领气流"
mDescription="占领气流"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_56 H7SeqAct_Quest_NewNode]
mTitle="占领巨人堤道"
mDescription="占领巨人堤道"
mRewardText="好样的"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_6 H7SeqAct_Quest_NewNode]
mTitle="元素任务"
mDescription=""
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_66 H7SeqAct_Quest_NewNode]
mTitle="进入火山 3"
mDescription="解除第三道火焰之门的封印"
mRewardText=""

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_67 H7SeqAct_Quest_NewNode]
mTitle="水龙之舟"
mDescription="学习水龙之舟法术"
mRewardText="恭喜"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_68 H7SeqAct_Quest_NewNode]
mTitle="黄金天使"
mDescription="拜访黄金天使"
mRewardText="干得好"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_69 H7SeqAct_Quest_NewNode]
mTitle="战斗天使"
mDescription="拜访战斗天使"
mRewardText="非常好"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_70 H7SeqAct_Quest_NewNode]
mTitle="僧侣"
mDescription="拜访僧侣"
mRewardText="太棒了"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_7 H7SeqAct_Quest_NewNode]
mTitle="怪物杀手"
mDescription="消灭500个怪物"
mRewardText="你是个杀手..."

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_8 H7SeqAct_Quest_NewNode]
mTitle="扩建活水"
mDescription="活水达到15级"
mRewardText="你是一位伟大的建筑师"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_83 H7SeqAct_Quest_NewNode]
mTitle="占领山谷要塞"
mDescription="占领山谷要塞"
mRewardText="一个漂亮的落脚点..."

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_Quest_NewNode_94 H7SeqAct_Quest_NewNode]
mTitle="占领熔岩河要塞"
mDescription="占领熔岩河要塞"
mRewardText="一个漂亮的第二居所..."

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_10 H7SeqAct_QuestObjective]
mDescription="找到并击败熔岩湖中的火元素"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_108 H7SeqAct_QuestObjective]
mDescription="占领气流"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_11 H7SeqAct_QuestObjective]
mDescription="找到并击败风之山的空气元素"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_12 H7SeqAct_QuestObjective]
mDescription="消灭500个怪物"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_120 H7SeqAct_QuestObjective]
mDescription="杀死火龙王"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_139 H7SeqAct_QuestObjective]
mDescription="占领巨人堤道"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_170 H7SeqAct_QuestObjective]
mDescription="学习水龙之舟法术"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_196 H7SeqAct_QuestObjective]
mDescription="解除第三道火焰之门的封印"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_209 H7SeqAct_QuestObjective]
mDescription="拜访黄金天使"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_210 H7SeqAct_QuestObjective]
mDescription="拜访战斗天使"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_211 H7SeqAct_QuestObjective]
mDescription="拜访僧侣"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_216 H7SeqAct_QuestObjective]
mDescription="占领山谷要塞"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_247 H7SeqAct_QuestObjective]
mDescription="占领熔岩河要塞"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_28 H7SeqAct_QuestObjective]
mDescription="活水达到15级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_327 H7SeqAct_QuestObjective]
mDescription="访问难民小屋"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_4 H7SeqAct_QuestObjective]
mDescription="找到克里斯蒂安爵士的墓穴"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_43 H7SeqAct_QuestObjective]
mDescription="找到并击败岩石中的土元素"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_44 H7SeqAct_QuestObjective]
mDescription="找到并击败瀑布的水元素"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_5 H7SeqAct_QuestObjective]
mDescription="解除第一道火焰之门的封印"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_59 H7SeqAct_QuestObjective]
mDescription="天使等级达到16级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_60 H7SeqAct_QuestObjective]
mDescription="天使等级达到25级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_61 H7SeqAct_QuestObjective]
mDescription="天使等级达到34级"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_77 H7SeqAct_QuestObjective]
mDescription="占领蔓延之火"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_1.H7SeqAct_QuestObjective_90 H7SeqAct_QuestObjective]
mDescription="解除第二道火焰之门的封印"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_0 H7SeqAct_ShowText]
mText="好样的天使，通过击败火龙王，你成功获得了阿尔卡斯的熔岩碎片，它将保护你的部队免受末日审判的影响。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_1 H7SeqAct_ShowText]
mText="干得好，你已经投资了第一火焰之门，许多守卫火焰要塞的火系生物已被送回地狱！\n当你投资了三个火焰之门后，整个驻军都将被送回。然后抓紧时间在其它生物被召唤来守卫之前占领要塞。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_10 H7SeqAct_ShowText]
mText="你想挑战水元素吗？"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_11 H7SeqAct_ShowText]
mText="欢迎来到末日之刃操控训练室..."

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_2 H7SeqAct_ShowText]
mText="干得好，你已经投资了第二火焰之门，许多守卫火焰要塞的火系生物已被送回地狱！\n当你投资了三个火焰之门后，整个驻军都将被送回。然后抓紧时间在其它生物被召唤来守卫之前占领要塞。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_3 H7SeqAct_ShowText]
mText="干得好，你已经投资了第三火焰之门，许多守卫火焰要塞的火系生物已被送回地狱！\n当你投资了三个火焰之门后，整个驻军都将被送回。然后抓紧时间在其它生物被召唤来守卫之前占领要塞。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_4 H7SeqAct_ShowText]
mText="矮人是放贷者，他们扣押着绯红火焰。\n如果你能让矮人听进道理，你的力量将增强十倍。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_5 H7SeqAct_ShowText]
mText="天使，你必须通过解决元素任务来证明你的价值和勇气。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_6 H7SeqAct_ShowText]
mText="好样的天使，你已经证明了你的勇气。你值得指挥元素生物！\n接收这些部队去对抗亡灵巫师吧。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_7 H7SeqAct_ShowText]
mText="你想挑战火元素吗？"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_8 H7SeqAct_ShowText]
mText="你想挑战空气元素吗？"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_9 H7SeqAct_ShowText]
mText="你想挑战土元素吗？"

[TheWorld:PersistentLevel.WorldInfo_0.H7MapInfo_0 H7MapInfo]
mName="末日之刃"
mDescription="情况严峻。亡灵巫师已决定向生者发动一场无情的战争。\n而这偏偏发生在最糟糕的时候，因为元素国度正处于分裂状态。\n为了赢得生命之战，你首先必须（必要时使用武力）联合所有元素国度。\n但这恐怕还不够！\n幸运的是，法师们发现了一种非常古老的魔法的踪迹，它能对所有战场上的敌人造成火焰伤害：神话般的末日之刃！\n这把非凡的剑与它的主人克里斯蒂安爵士长眠在一起，后者在很久以前需要它时曾创造过奇迹。\n为了让游戏更有趣，请（在左侧）为所有AI选择英雄难度。\n为玩家1到4选择元素，为玩家5和6选择亡灵巫师。\n不过，你可以（在右下角）选择你想要的难度级别。\n许多魔法物品和英雄在本场景中不可用，以增加可玩性。\n手工制作的地图。\n需要使用英雄无敌7.5版本1.36或更高版本进行游戏。\n\n感谢Jubi制作了某些魔法物品。:)"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_12 H7SeqAct_ShowText]
mText="天使，你是水之英雄。你得到了艾伦的帮助，他是一位拥有强大财务才能的法师，将协助你管理你的城堡。\n亡灵巫师已决定终结人类和元素生物。你的间谍告诉你，亡灵巫师很快将派遣他们的英雄梅里赫袭击你的领土腹地。\n你必须为此做好准备。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_13 H7SeqAct_ShowText]
mText="为了抵抗亡灵巫师的入侵，你必须集结元素力量。\n唉，你的邻居们似乎不太合作。\n你将不得不说服他们与你结盟……必要时动用武力。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_14 H7SeqAct_ShowText]
mText="你的间谍很确定，他们发现一个非常强大的亡灵巫师莫安德尔集结了一支庞大的亡灵军队。\n这支军队如此强大，你极不可能击败它。\n幸运的是，水系法师发现克里斯蒂安爵士——一位古代英雄——与他的神话之剑末日之刃一同被埋葬。\n这把剑威力无比，可以帮助你击败莫安德尔。\n留下来寻找克里斯蒂安爵士的埋葬地点。"

[TheWorld:PersistentLevel.Main_Sequence.Sequence_2.H7SeqAct_ShowText_15 H7SeqAct_ShowText]
mText="传说似乎表明克里斯蒂安爵士墓穴的入口位于一个岛屿上。\n唉，没有船能到达这个岛屿。\n你必须找到另一种方法……"